guivbalduino/Mestrado/libs/libelium/waspmote-pro-ide-v06.31/hardware/waspmote/avr/boards.txt
menu.cpu=Processor

##############################################################

wasp1.name=Waspmote API v056

wasp1.upload.tool=avrdude
wasp1.upload.protocol=stk500v1
wasp1.upload.maximum_size=122880

wasp1.upload.maximum_data_size=8192
#wasp1.upload.maximum_ram_size=8192
#wasp1.upload.warning_ram_size=7168
wasp1.upload.disable_flushing=false

wasp1.upload.speed=115200

wasp1.build.mcu=atmega1281
wasp1.build.f_cpu=14745600L
wasp1.build.board=AVR_WASP
wasp1.build.core=waspmote-api

